Revit 2024 API
EditorInteraction Members
The EditorInteraction type exposes the following members.
Constructors
Name | Description
EditorInteraction()
 Construct a default interaction.
EditorInteraction(EditorInteractionType)
 Construct the interaction with the specified type.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
InteractionType
 The type of interaction.
See Also
EditorInteraction Class
Autodesk.Revit.UI Namespace